[
    {"name":"Ansinosth Summerbough","title":"Chronicler, Master Sorcerer","photo":"assets/frames/ansinosthportrait.png","history":"A famed sorcerer whose recent work chronicling the history of the elven people has eclipsed even his own groundbreaking magical research, the aging scholar is seen by many as either pariah, or legend. Both deadly and wise, he's a reserved sort of individual who cherishes his time alone.","frame":"assets/frames/portrait-thin-gold.png"},
    {"name":"Hespir Everwyern","title":"Mage","photo":"assets/frames/hespirportrait.png","history":"An apprentice of Master Sorcerer Ansinosth Summerbough, this young Sin'dorei has spent his whole life running from one battle to the next. Just a young apprentice during the fall of Quel'Thalas, he was conscripted into the Sunfury forces and struggled through the war before his capture, and later reconditioning. Drawn into the endless fighting which has strangled Azeroth these recent years, Hespir's longing to return to a simple life has been hard to realize, but at long last, after years apart, he's reunited with his teacher, his brother, and finally given a chance at resuming some sense of normalcy in his life.","frame":"assets/frames/portrait-thin-gold.png"},
    {"name":"Gladathan Skyshroud","title":"Sorcerer","photo":"assets/frames/placeholder.png","history":"A veteran of the Magistry whose lineage can be traced back not to just the founding of the nation, but also the ancient Highborne caste of the Kaldorei Empire, Gladathan has been at the forefront of the Quel'dorei and Sin'dorei narrative all of her life, and her bravery and mastery over magic has made her an invaluable ally both on and off the field of battle.","frame":"assets/frames/portrait-thin-gold.png"},
    {"name":"Andrys Blackthorn","title":"Illidari","photo":"assets/frames/AndrysBlackthornportrait.png","history":"Once a Sin'dorei row-rat, Andrys Blackthorn bears the fel-scorched scars of his oath to Illidan, his eyes burned away in exchange for sight beyond sight. Cloaked in haunted elegance, he wields his torment as both weapon and penance, a blade sharpened against the corruption that made him."},
    {"name":"Aelenden Starshatterstar","title":"Magister","photo":"assets/frames/aelendenshatterstarportrait.png","history":"A highly skilled sorcerer of the arcane and more, Aelenden has spent much of his life studying the darker forms of magic in an effort to understand and counter their impact, and he now finds himself on the front lines to safeguard the elven people, using his masterful skills to hold at bay the darkness threatening to destroy the elven people."},
    {"name":"Hal'sonas Windreaver","title":"Ranger","photo":"assets/frames/halsonaswindreaverportrait.png","history":"Once a ruthless and efficient Farstrider captain, Hal’sonas has spent decades seeking to avenge his people’s tragedies and reclaim their place within the Kingdoms. Now the Ranger-General of Mala’Danil, a sovereign realm home to wayward elves, he protects what remains of the Quel’dorei legacy with a bleeding heart and a cold countenance."},
    {"name":"Thalena Thori'zaram","title":"Scholar","photo":"assets/frames/thalenathorizaramportrait.png","history":"Hailing from a militant lineage that dates back to the Highborne era, Thalena is a sharpwitted magus that dedicates her time to magic and knowledge. As another skilled apprentice to Ansinosth Summerbough, she assists him in the preservation of their ilk’s history. But her skills are far beyond chronicling stories. <br><br>Her passions lie in the retrieval of precious artifacts, magical research involving uncovering secrets that are best kept hidden, and providing wares to those devoted to spellcraft and adventuring. While she’s devoted to magic, the love for her High Home fails to falter and she will do anything to preserve it."},
    {"name":"Zanrolia Sprenlen","title":"Warlock","photo":"assets/frames/zanroliasprenlenportrait.png","history":"Lady Sprenlen is counted among the many elves of Quel'Thalas who took up the fel to seek revenge against the Lich King, and to avenge the Quel'dorei. That dedication and sacrifice has led her to become both deadly and cunning, and her raw power and mastery of fel has proven more than enough to make up for her curt and often abrasive manner."},
    {"name":"Alen'dris Sunwalker","title":"Spellblade","photo":"assets/frames/alendrissunwalkerportrait.png","history":"Alen’dris Sunwalker is a field operative and arcane specialist with extensive experience in artifact recovery, leyline stabilization, and hostile environment navigation. Once trained for war as part of the Illidari, he now channels that same precision and strength toward restoration and preservation. Born to a family of merchants and craftsmen, with noble arcane lineage through his mother, he balances practical grit with refined magical discipline. Quiet, focused, and steady, he values control over spectacle."},
    {"name":"Lamplighter Kharyym","title":"Lamplighter","photo":"assets/frames/lamplighterkharyym.png","history":"Once a child born of the Arathi Empire, once a priest of the Sacred Flame, once a Lamplighter fighting back the dark,  Kharyym is now merely a wanderer following the old stories back to the lands from whence his ancestors once came. The embers within burn still, but the zeal that fed them now seeks a new cause."},
    {"name":"Malchiades Silversun","title":"Magister","photo":"assets/frames/malchiadessilversunportrait.png","history":"Archmage of the Kirin Tor and scion of the once prestigious House Silversun. Malchiades forged his reputation during the Nexus War and has stood against nearly every great threat to Azeroth since. A master of both battlefield magic and scholarly pursuit, his name carries the weight of multiple military campaigns and published works. Now, with the death of his father, his attention turns toward restoring the honor and legacy of House Silversun, even as new dangers loom."},
    {"name":"Alindriel Brightward","title":"Artificer Priest","photo":"assets/frames/alindrielbrightwardportrait.png","history":"Once an experiment of Neltharion, now a priestess of the Light. The warm dracthyr known as Alindriel Brightward has taken root in Quel'thalas. She seeks to help rebuild her new home and aids its peoples as her own."},
    {"name":"Kindrith Windstalker","title":"Ranger","photo":"assets/frames/kindrithwindstalkerportrait.png","history":"Kindrith Windstalker is a highly skilled spellbow that once helped protect the homelands of the Quel'dorei until the Scourge invasion and subsequent abandonment of the Alliance by her people. She, along with her trusted owl companion Kría, now walks the lands and does what she can to keep her people safe, including her more recent return to Quel'Thalas. As a skilled arcane with a talent for the arcane, you never know what you might encounter next when let points an arrow in your direction."},
    {"name":"Soryn Cloudspire","title":"Fighter","photo":"assets/frames/soryncloudspireportrait.png","history":"A failed student of magic turned martial artist, Soryn Cloudspire has begun to grow past his previous failures to step up and fight for his home when he previously could not. He lends his brawn to the Fellowship in order to defend Quel'thalas and all its citizens, especially his fellow commoners. He's more than happy to face greater and greater challenges in the process."},
    {"name":"Caledeth Bloodthorn","title":"Blood Knight","photo":"assets/frames/caledethbloodthornportrait.png","history":"Formerly a priest of the Eternal Sun, Caledeth took up the oath of the Blood Knights at the order's founding, and vowed to avenge his wounded homeland. After serving dutifully for many years, and rising to the esteemed rank of Knight-Lord, he has retired from active duty, but now pursues nother means of defending his homeland."},
    {"name":"Quely Phoenixheart","title":"Magistrix","photo":"assets/frames/quelyphoenixheartportrait.png","history":"A magistrix and mage in the service of Silvermoon who places great value is service. She has done everything from expeditions to teaching the younger generations the wonder of magic for her kingdom."},    
    {"name":"Irrandina Tassarian","title":"Magistrix","photo":"assets/frames/irrandinatassarianportrait.png","history":"Irrandina Tassarian is a frail little half breed with a passion for all things elven and magical. Shy and rather timid, she prefers stuffing her face into the Stormwind tax code or some tome of magical theory heavier than she is to actual conversation. Yet she's caring and riddled with compassion; so much so that she wouldn't dare use magic around others - a kindness, truly."}
]

