[
    {"name":"Hespir Everwyern","title":"War Mage","photo":"assets/frames/hespirportrait.png","history":"An apprentice of Master Sorcerer Ansinosth Summerbough, this young Sin'dorei has spent his whole life running from one battle to the next. Just a young apprentice during the fall of Quel'Thalas, he was conscripted into the Sunfury forces and struggled through the war before his capture, and later reconditioning. Drawn into the endless fighting which has strangled Azeroth these recent years, Hespir's longing to return to a simple life has been hard to realize, but at long last, after years apart, he's reunited with his teacher, his brother, and finally given a chance at resuming some sense of normalcy in his life.","frame":"assets/frames/portrait-thin-gold.png"},
    {"name":"Ansinosth Summerbough","title":"Chronicler, Master Sorcerer","photo":"assets/frames/ansinosthportrait.png","history":"A famed sorcerer whose recent work chronicling the history of the elven people has eclipsed even his own groundbreaking magical research, the aging scholar is seen by many as either pariah, or legend. Both deadly and wise, he's a reserved sort of individual who cherishes his time alone.","frame":"assets/frames/portrait-thin-gold.png"},
    {"name":"Gladathan Skyshroud","title":"Magistrix","photo":"assets/frames/placeholder.png","history":"A veteran of the Magistry whose lineage can be traced back not to just the founding of the nation, but also the ancient Highborne caste of the Kaldorei Empire, Gladathan has been at the forefront of the Quel'dorei and Sin'dorei narrative all of her life, and her bravery and mastery over magic has made her an invaluable ally both on and off the field of battle.","frame":"assets/frames/portrait-thin-gold.png"},
    {"name":"Velenlan Blackwood","title":"Blood Knight","photo":"assets/frames/placeholder.png","history":"A Blood Knight of Quel'Thalas with both a strong moral foundation and a quick and inquisitive mind, he is one of the first of the Blood Knights to properly join the Fellowship.","frame":"assets/frames/portrait-thin-gold.png"},
    {"name":"Menadrael Embermourn","title":"Priestess","photo":"assets/frames/menadraelportrait.png","history":"A Priestess of the Light. Menadrael was born from the embers of a family that once shone upon the lands of Quel’thalas, becoming the last of her line years later. She uses her knowledge of the Light to guide not only her own path, but others who may have shared her same sorrow or madness."},
    {"name":"Andrys Blackthorn","title":"Illidari","photo":"assets/frames/AndrysBlackthornportrait.jpg","history":"Once a Sin'dorei row-rat, Andrys Blackthorn bears the fel-scorched scars of his oath to Illidan, his eyes burned away in exchange for sight beyond sight. Cloaked in haunted elegance, he wields his torment as both weapon and penance, a blade sharpened against the corruption that made him."}
]
  