{
  "meta": {
    "source": "history.html",
    "generated_from": "/mnt/data/history.html",
    "note": "Entries extracted from the Elven Historical Chronicle volumes I-IV and modified."
  },
  "sections": [
    {
      "id": "magicschool",
      "title": "Series: Magical Instruction",
      "subtitle": "Shatterstar Arcanium & The Fellowship's Academic Curriculum'",
      "date": "c. Year -2,680 to Present",
      "summary_html": "<p>Magical instruction occurs within the Fellowship without end, offering new avenues of study to practitioners of all levels of experience. Guest instructors, lecturers, and full time practicing educators provide around the clock mentoring, with larger courses on special topics presented on the regular.</p>",
      "order": 600,
      "entries": [
        {
          "id": "nov12ms",
          "title": "Worldly Connections: Thalassian Abjuration in Defense of the High Home",
          "summary_html": "<p>Master Sorcerer Ansinosth Summerbough hosts a lecture for the Fellowship and its attending guests on the historic role and functionality of Ban'dinoriel, its destruction, and the viability and necessity of efforts to restore or forge a new barrier for the High Home.</p>"
        },
        {
          "id": "oct17ms",
          "title": "The Arcane Fundamentals: Practical Spellwork",
          "summary_html": "<p>Magister Aelendan Shatterstar leads an instructional class for the Fellowship and its attending guests on the finer points of practical spellcasting.</p>"
        },
        {
          "id": "oct10ms",
          "title": "Arcane Enhancement: Surge Protection",
          "summary_html": "<p>Master Sorcerer Ansinosth Summerbough leads an instructional class for the Fellowship and its attending guests on the process of harnessing arcane surges.</p>"
        },
        {
          "id": "oct3ms",
          "title": "The Arcane Fundamentals: The Weave and the Well",
          "summary_html": "<p>Magister Aelendan Shatterstar leads an instructional class for the Fellowship and its attending guests on the basic fundamentals on the arcane.</p>"
        },
        {
          "id": "nov7ms",
          "title": "Worldly Connections: Ethereal Affairs",
          "summary_html": "<p>Master Sorcerer Ansinosth Summerbough hosts a lecture for the Fellowship and its attending guests on advanced understances of the affairs of the Ethereum, their affairs on the shattered Outlands, and its recent resurgence in activity specific to the conflict with the Legion.</p>"
        },
        {
          "id": "june12ms",
          "title": "Arcane Enhancement: Runes of Power",
          "summary_html": "<p>Magistrix Gladathan Skyshroud leads an instructional class for the Fellowship and its attending guests on power stones and other runes used for empowering spellcasting, and how to prefent overcharges when dealing with unstable power sources.</p>"
        },
        {
          "id": "apr6ms",
          "title": "Advanced Arcane Practices: Multi-School Spellcasting",
          "summary_html": "<p>Master Sorcerer Ansinosth Summerbough and Well Warder Sarnal lead an advanced instructional class for the Fellowship and its attending guests on higher level blended school spellcasting, focusing on the fusion of holy and arcane power and its application in abjuration.</p>"
        },
        {
          "id": "mar2ms",
          "title": "The Arcane Fundamentals: Somatic Rune Casting",
          "summary_html": "<p>Master Sorcerer Ansinosth Summerbough leads an instructional class for the Fellowship and its attending guests on the basics of somatic rune spellcasting and non-verbal arcanomancy practice.</p>"
        },
        {
          "id": "feb16ms",
          "title": "The Arcane Fundamentals: Seeing Through Spellwork",
          "summary_html": "<p>Magistrix Gladathan Skyshroud leads an instructional class for the Fellowship and its attending guests on discerning motive and technique by way of scrying and divination, with a focus on countering spell casting.</p>"
        },
        {
          "id": "jan2ms",
          "title": "The Arcane Fundamentals: Conduit Anchoring",
          "summary_html": "<p>Magistrix Gladathan Skyshroud leads an instructional class for the Fellowship and its attending guests on the mechanisms of conduit anchoring when drawing energy from a multitude a sources.</p>"
        }
      ]
    },
    {
      "id": "event013",
      "title": "Event: The Missing Ring",
      "subtitle": "January 28",
      "date": "c. Year 42",
      "summary_html": "\n The Fellowship, under the direction of Tal'theas Sunfeather, journey to the ruins of Dalaran on the Isle of Dorn to pursue a missing ring of the Silver Covenant, one which has now drawn the attention of sinister Twilight cultists. Joined by Hespir Everwyern, Sorrien Kalos, Jeshacinin Evertrail, Kynsteria Vel'dinariel, Velara Clark, Dalentheus Ombrelune, and Arcanist Silanna Leyspire, the Fellowship breaches the shattered ruins and recovers the artifact. \n",
      "order": 45
    },
        {
      "id": "campaign3",
      "title": "Campaign: Ashes of the Sunward Betrayal",
      "subtitle": "Long Narrative Campaign",
      "date": "c. Year 42",
      "summary_html": "<p>Something stirs along the borders of Quel’thalas. Not a warband. Not a horde. Small movements. Measured strikes. Undead forces that advance, test, and withdraw as if learning, rather than conquering. Rangers report Scourge activity that does not behave as it should. Magisters note wards disturbed, not broken. Old places are being touched again. Border posts long abandoned, names long absent from record. Whatever leads these incursions understands elven magic. Understands procedure. Understands what was left behind. The Blood Knights have authorized a quiet response. Small teams. Limited knowledge. No assumptions. Some will strike at the threat directly. Others will follow the threads it leaves behind. Because this is not a story of invasion. It is a story of memory. Of duty. And of what happens when someone who was sworn to protect is never called home. \n The dead remember. \n And someone is making sure Quel’thalas does too.</p>",
      "order": 44,
      "entries": [
        {
          "id": "campaign.1",
          "title": "Event: Soon to come!",
          "date": "TBD",
          "summary_html": "<p>Recaps will be added after the first event!</p>"
        }
      ]
    },
    {
      "id": "event012",
      "title": "Event: January Ascension",
      "subtitle": "January 24",
      "date": "c. Year 42",
      "summary_html": "\n The Fellowship convenes in the ruined sanctum beneath the guild hall, a place once at the center of the Fellowship's daily life, and hold an induction ceremony, known as the Ascension, to formally admit new members to the order. Among those inducted in the rare mass-oath swearing are: <li>Alen'dris Sunblossom</li> <li>Allithndria Lightstriker</li> <li>Ashadarie Lightreign</li> <li>Bellatorriel Riel</li> <li>Calcydo</li> <li>Gwaeloth Songwood</li> <li>Haldarin Autumnveil</li> <li>Jendral Rosepath</li> <li>Jeshacinin Evertrail</li> <li>Kynseria Vel'dinariel</li> <li>Papilio Havenfire</li> <li>Tal'theas Sunfeather</li> <li>Thalena Thori'zaram</li>\n",
      "order": 43
    },
    {
      "id": "fic005",
      "title": "Story: A Letter for the Aspirant",
      "subtitle": "by Tulindi De Cœur-Errant",
      "date": "January 23",
      "summary_html": "<p>About a half hour ago, one of Tulindi’s arcane constructs had notified her of a puzzled elven courier ambling about the empty lot she had registered as her place of residence. If not for her recent socialization with the Elrendar Fellowship, she’d have let him idle about until he gave up and left—as she had done to many couriers before. However, she had expected a formal invitation of some kind to arrive soon. Instead she instructed her construct to meet him.</p>\n\n<p>The unstable machine, a sphere about the size of an orange, lurched towards an open portal. The construct’s hastily engineered metal limbs dragged across the floor as it stumbled through the rift. Tulindi watched the transition from the corner of her eye through a second aperture. This viewing portal offered a grainy, flickering glimpse of the empty lot where the little orb now tumbled into existence before the startled courier.</p>\n\n<p>The elf, perplexed by her creation, stared at the construct for a long moment. It was only when the construct extended its hand for the missive that he understood. He pressed the missive into the construct’s wobbly hand and then pivoted on his heel. Tulundi chuckled to herself as she wondered what story he would tell the other couriers about the oddity he encountered today. When the construct returned to Tulindi’s workshop she plucked the missive from its hands and shooed it away.</p>\n\n<p>She was quick to break the wax seal and unfold the tri-folded letter. As she began to read, she paced the floor. As she paced, she stepped over piles of miscellaneous items, her feet heavy after twelve hours on the stone floor. The workshop was a masterful labyrinth of mana-pumps and mana-pipes that flanked either side of the room and snaked across the ceiling. Tulindi had every resource she thought she may need to study leylines, advance her telemancy, and manipulate portals. However, it verged on inhospitable. She lacked a proper place to sit—or even sleep for that matter. Fortunately, she had a solution for that.</p>\n\n<p>Butted up against the centermost vertical pipe in the room was her makeshift workstation. The unstable workbench was buried in various research documents, tomes, scrolls, scratch paper, and hand-tools for calibrating her machines. Tulindi reached for her staff, paused to memorize a scrawled set of coordinates on the desk, and then struck the butt of the staff against the floor. A low hum vibrated through the metal, answered by a crackle of wild energy from a pipe along the ceiling.</p>\n\n<p>The energy struck the centerpoint of the staff head, passed through it, and then tore a rift in the air. As the portal opened, the smell of dusk lilies filled the workshop. Beyond the jagged edges of the unstable portal was her preferred retreat; a Shal’dorei dormitory. The room had once been hers, allotted to her during her time enrolled in the Academic Scholar’s Society. However, an accident caused by her and a peer resulted in the room being trapped within the Twisting Nether. Thankfully, her mentor had acknowledged her potential and spared her from expulsion.</p>\n\n<p style=\"text-align:center; opacity:.85;\">*</p>\n\n<p>The portal snapped shut behind her, sealing out the hum of the workshop. Tulindi collapsed onto the mattress with a heavy sigh. She kicked one boot off with her heel, then the other, letting them clatter unceremoniously to the floor as the ache in her arches began to throb. Holding the letter above her head, she turned to the second page.</p>\n\n<p>It was there she stopped reading and let her arms fall to her sides, the letter still in her left hand. Two lines of the vow gripped her heart with guilt.</p>\n\n<p><em>“...And that I be keeper, not tyrant; blade in the shadow, not hand of terror.”</em></p>\n\n<p><em>“...Should I turn my art to cruelty, my wisdom to vanity, or my silence to cowardice…”</em></p>\n\n<p>The words not only resonated; they felt like a verdict. At the Grand Magistrix’s will, she had weaponized her telemancy and exiled rebels from Suramar. Elisandre gave the command, but it was Tulindi’s hand that had doomed the rebels to the inhospitable world beyond the barrier.</p>\n\n<p>She stared at the ceiling, wondering now which fate was a truer mercy. A swift execution beneath the blade, or the agonizing starvation that was a Withered’s hollow existence.</p>\n\n<p>Tulindi let the letter slip from her fingertips and flutter to the floor beside her discarded boots. She pressed her now empty hand to her chest and breathed in sharply; the air was sweet with the smell of the dusk-lilies, but the smell of home did not comfort her.</p>\n\n<p>As the familiar, gnawing hunger began to tug softly at the edges of her mind, she stared at the bottle of Arcwine on her nightstand. The wine would provide an easy warmth and satiate her hunger. Instead, Tulindi closed her eyes, shunning the vintage as if the comforts it offered were a lie. She lay upon the bed, her arms pressed tightly to her chest, and let the silence of the room swallow her whole.</p>\n\n<p><em>One thought pursued her into the dark: I was a tyrant then, and I am a coward now.</em></p>",
      "order": 42
    },    
    {
      "id": "event011",
      "title": "Event: Fellow's Soirée",
      "subtitle": "January 22",
      "date": "c. Year 42",
      "summary_html": "\n The Fellowship gathers with guests from abroad to celebrate life and free spirit, holding a soiree within the order's halls. In attendance: <li>Ansinosth Summerbough</li><li>Gwaeloth Songwood</li><li>Baroness Belorastra A. Dragonlight</li><li>Haldarin Autumnveil</li><li>Em'thela Silversun</li><li>Gwaeloth Songwood</li><li>Y'lothin Kar'Storas</li><li>Alen'dris Sunblossom</li><li>Calcydo</li><li>Dalentheus Ombrelune</li><li>Arcanist Silanna Leyspire</li><li>Magistrix Laelisel Goldsong</li><li>Kynseria Vel'dinariel</li><li>Jeshacinin Evertrail</li><li>Velara Clarke</li><li>Roxalynn Windsong</li><li>Sorrien Kalos</li><li>Tulindi De Coeur-Errant</li>\n",
      "order": 41
    },
    {
      "id": "fic004",
      "title": "Story: A Perfect Blade",
      "subtitle": "by Haldarin Autumnveil",
      "date": "January 20",
      "summary_html": "<p><strong>CLANG. CLANG. CLANG.</strong></p>\n\n<p>Haldarin kept the hot piece of metal in place with iron tongs. While his hammer expertly guided the lump into a new shape over an anvil. Arcane runes ignited along its edges with every white-knuckled hammer blow. Thereby drip feeding trace amounts of magic into the material being labored over.</p>\n\n<p><strong>CLANG. CLANG. CLANG.</strong></p>\n\n<p>Once the metal began to cool, it was held inside a nearby forge to preserve its malleability. An enchanted bellow independently maintained the desired temperature. When the metal made contact with the hearth, purple and gold flame erupted forth. More of a magical, rather than natural, reaction due to the material’s special properties.</p>\n\n<p>A normal blacksmith might have recoiled from the sudden and powerful outburst of heat. Or at the very least better insulate themselves from harm in advance. Arm protection would’ve been especially desirable at that moment. And goggles to protect the eyes from any flying debris. Or from metallic fragments as a result of hammering. However, he no longer had any eyes to keep safe. And his skin, warped into a sort of scaled hide by demonic corruption, remained unbothered by the warmth.</p>\n\n<p>The metal, now practically glowing orange, was repositioned onto the anvil. Where Haldarin resumed the banging of his hammer. Most might’ve deemed what he was doing to be tedious. Punishing. Exhausting. And yet not for a moment did he ever slow down.</p>\n\n<p>For Haldarin, this was all a unique form of meditation. A way for him to detach from the world by focusing solely on the work. Even as the whispers licked at the edges of his mind. A malevolent presence that’d been with him ever since he absorbed it all those years ago at the Black Temple.</p>\n\n<p>It didn’t like whenever he set himself into performing anything it deemed pointlessly monotonous. And it disapproved of the material he’d chosen to use for this latest commission. Namely a batch of Sunwell-infused iron ore from Quel’Danas which he’d processed into steel.</p>\n\n<p>He recalled how difficult it was to obtain. And the tingle it left whilst being handled with his bare hands. Surprisingly it did not hurt or burn as he’d feared, but he nevertheless understood it was not something to ever be used for his own personal purposes. As if doing so was ever worth serious consideration.</p>\n\n<p>Another thing he noticed is how hard it is to work with. It required many more additional passes for processing, both hammering and folding, to remove its carbon impurities. At the time he wondered to himself why that is. A question to be answered later, perhaps. For now, his focus had to above all else remain fixed upon the work.</p>\n\n<p><strong>CLANG. CLANG. CLANG.</strong></p>\n\n<p>Even with his heightened stamina and heat tolerance, this was demanding toil. The metal, as previously mentioned, was more demanding to work with than anticipated. Yet he still welcomed it as he persevered through the rough labor next to a sweltering furnace. By now the voice was also finally quiet. Ever since the Legion’s defeat it had thankfully become less active, more docile. Especially during these moments when he was able to maintain his focus.</p>\n\n<p>“Good morning, Haldarin!” For a second, Haldarin thought the voice had returned. Instead, it was somebody he considered marginally less annoying. “Do you need more? I hope not because you’ll just bankrupt yourself.” Josara is a well-traveled sin’dorei merchant with what some would call a gift for gab. She is a necessity when operating this kind of business. Because there was always a need for somebody who could reliably acquire less common crafting materials. Like processed ore which needs to be blessed at the sin’dorei’s most holiest site. Josara also happened to be unnervingly good at sneaking up on people.</p>\n\n<p>“No.” Haldarin replied, then returned to his work. He wasn’t trying to be rude. Really. This metal was in fact incredibly expensive. And if he allowed it to cool it would become useless. He couldn’t allow that for multiple reasons.</p>\n\n<p>“Uh-huh. .. I’ve personally never had somebody request so much of it before. It’s not usually the type of thing people need when I’m involved, if you catch my drift. And I definitely wouldn’t have imagined a big and mean looking Illidari to need it.” Josara pondered amidst getting seated at the edge of the store’s counter. “I mean, obviously it’s a commission. Which means some Light-kisser approached you to make something for them. Did the horns not send them screaming in the other direction or what?”</p>\n\n<p>The hammer came to a sudden stop, then an exhale. Josara tensed up the moment his golden half-mask came to point toward her. “Relax! I’m just thinking out loud.” She stressed with both hands held up. “Why are you really hovering around me, Josara?” He replied after feeding the orange-yellow steel back into the yet burning forge.</p>\n\n<p>“Right, so. .. Um. Hey, is Kori here?” Josara was wearing an all too large smile following the question. Haldarin assumed that whatever the two of them were up to, it was no good. “She is hunting.”</p>\n\n<p>He actually wasn’t sure where she had gone off to. It was more of just an educated guess. As this is a commission he felt necessary to do on his own. His answer elicited a skeptical look from Josara.</p>\n\n<p>“Hunting? You do both enjoy killing demons.” The merchant twiddled her thumbs while Haldarin resumed pounding his hammer. Every so often tapping it against the anvil itself every three strikes. “I’m surprised you didn’t join her.”</p>\n\n<p>“This is a priority.” Haldarin answered, with the lump by now starting to look very much like a sword. Once this was done, the pattern welding process would begin. To provide the blade’s surface with a kind of hued water pattern at completion.</p>\n\n<p>“Normally I’d start digging for more. Normally! I was just stopping by, though. There’s a shipment I still need to deliver.” The skinny sin’dorei got off the counter and began making her way to the exit. “The next time I’m around I want answers, Hald!”</p>\n\n<p>“Give me a discount on next month’s coal delivery.” Haldarin’s statement got a quick laugh from his talkative guest. “HA! And I want a Sunstrider on the throne. Let’s see who gets what they want first.”</p>\n\n<p>With that, Josara took her leave. Continuing with her colorful commentary the whole way. He could even hear her talking outside despite the lack of audience. An impressive feat if taking into consideration all of the smithy’s ambient noise. There was a part of him which genuinely found her somewhat endearing. A small part, but a growing one.</p>\n\n<p>After a little bit longer, the blade was held up for inspection via his prongs. It was still glowing from the heat. There was a little shaping left to do. Afterwards would come the runic etchings. And then, last but not least, the final installation of a handle that had already been completed the day before.</p>\n\n<p>Everything so far was going to plan. Haldarin hoped it would remain that way. And if not, he would start all over again without complaint. He’s sure Josara would welcome the additional business.</p>\n\n<p>Because Kynseria’s commission was too important and it had to be done exactly right. Nothing short of perfection would in his mind be enough. Especially if she was planning to actually use what he’s crafting in combat. And besides, she deserved nothing less.</p>",
      "order": 40
    },    
    {
      "id": "fic003",
      "title": "Story: Rebirth",
      "subtitle": "by Y'lothin Kar'storas",
      "date": "January 20",
      "summary_html": "<p>The antechamber was immense, its ceilings vaulted, its walls bore ancient draenic designs. Y’lothin thought it a shame, a sanctified place turned to the profane, but all in the name of stopping the Legion is permissible, he thought.</p>\n\n<p>The neophyte stood in the middle of the binding circle, surrounded by his peers. They all observed the broad elf, a sin’dorei among a circle of both kin and distant cousins. Y’lothin gave himself to the flame, unwillingly. He recalled what reasons brought him here, to this devious place. He recalled his wife, his duo of boys, the small hamlet in the summery reaches of Eversong. He took those memories into his heart, and held them in the forefront of his mind.</p>\n\n<p>Another thought flared, the Prince of the High Kingdom, and the reasons the Sunfury were brought forward. He, and many others, were among the legion given to the Illidari. Thus was the beginning of a new path, and he hardened his heart to the disdain within. Ultimately, he agreed with what had to be done.</p>\n\n<p>Y’lothin exhaled, his deep emerald eyes looking to the veteran teacher, and steeled himself. “I am ready.”</p>\n\n<p>One of his fellows, a kaldorei woman, offered the once-Spellbreaker his glaive once again. He took his weapon up with a twirl, bringing the haft of the spell-wrought weapon below his left shoulder. He relished the weight of that unique weapon, letting it reinforce those fond memories.</p>\n\n<p>The elder Hunter raised a taloned hand. Pallid green burned into existence around Y’lothin as he braced himself. The Sin’dorei stood in the middle of a spellcircle, even as it burned into life. At the core of this horrific ritual, an embryo of gathered energy formed into reality, drawing forth a denizen of the netherrealms, a member of the Legion’s hellish stables; a Wrathsteed. The fiend stood, some nine feet tall, a parade of baleful spikes and scale glinting against the emerald lights, its eyes burned with rage and murder in its mind.</p>\n\n<p>Just as quickly as it began, the Wrathsteed was summoned, and Y’lothin was upon it. His glaive sung as he charged the beast’s armored left leg, delivering a shattering blow upon the Demon. The magical structure of the demonic being shimmered harshly as the mana was shattered from its fel-infused body. In retort, the great beast hoisted its fel-forged hooves against the neophyte, striking out for his body.</p>\n\n<p>Y’lothin fell back upon the extreme training and conditioning that he and so many others had been exposed to. He moved like a ghost, ducking away from the wild strike, and coming to deliver another shattering blow against the corrupted thing. The blow struck home at the back of the beast, fel-ichor spurted into the air, illuminated within by its very nature. Another, empowered strike fell upon the Wrathsteed’s other foreleg, brought upon by the hindblade of the neophyte’s mage-bane weapon.</p>\n\n<p>The demon loosed a roar of sheer, unrelenting hatred for what it fought, and those surrounding it. In a blind fury, the Wrathseed reared back and drove its hind legs in a flurry of strikes and bursts of infernal magic.</p>\n\n<p>The whirlwind struck Kar’storas in the chest, two lashes of fel-burnt steel raising across his bare chest. The elf hissed in pain, the feeling of those deep cuts causing greater duress from the effort of motion, but the pain drove him.</p>\n\n<p>Y’lothin rushed the dark steed, his own blade held low, eager for blood. He ducked low, moving between those lashing swords before coming close to deliver another shattering blow upon the back of the Wrathsteed’s knee, and bring it low. With a cry of rage, and effort, Y’lothin drove that glaive home, into the chest of the demonic beast, and lashed it upwards, severing spine, tendon, muscle, and sinew. The beast fell away, face first into the stone-wrought floor.</p>\n\n<p>The neophyte continued the ritual, panting and wounded from the battle prior. Y’lothin found himself at his knees, holding his chest in agony as the demon steel seethed at his body.</p>\n\n<p>“Continue!” Barked the veteran Hunter. The sin’dorei did so, rising from his knelt posture, blood soaking his heaving chest and abdomen. He’d hoist his twin blade, and carved away at the sundered fell equine, and began to consume the demon.</p>\n\n<p>Y’lothin carved away chunk after chunk, consuming demonic flesh and muscle. The taste was acrid, terrible, as if he was chewing on ignited coals, but he continued, tears streaming down his cheeks as he continued. He’d draw that magebane twinblade and hoist it high, carving into the Eredar’s chest, and found its heart. He’d reach forward and rip it away, staring at the still beating thing. He’s come this far, he would see it through. Opening his mouth wide, the neophyte bit true into the heart, consuming the demon, heart, soul, and blood.</p>\n\n<p>Moments later, Y’lothin doubled over, his arms holding his abdomen as he began to scream in agony. The other Illidari looked on, observing the screaming elf. Within the mind of the Spellbreaker, he felt the shadow of the Legion roll over him, the infinite worlds, the numberless legions, and its burning master. Y’lothin began to claw at his eyes, the existential fear coming to its zenith. As the apex came, Y’lothin couldn’t unsee what he observed, only to press his thumbs into his eyes, until nothing was remaining but bloody pulp. The neophyte fell unconscious moments later.</p>\n\n<p>The ritual done, his soul bound forever to the demon’s, Y’lothin Kar’storas’ life was thus forever changed. He shed his bonds of loyalty to anything other than the Illidari, and the fate of Azeroth. The neophyte was taken from the circle, carried by the dregs of Illidan’s ilk, the Ashtongue. They carried the comatose elf to a cell, placing him onto a mat and bed roll.</p>\n\n<p>Within the mind of Kar’storas’, battles raged, wars waged. The Wrathsteed, known as Ostagoth, the Iron Warden, vied for dominance over the mind of Y’lothin, the Spellbreaker. The two fought like titans amongst the mental scapes of the elven man, every time the demon altered the memories of the Y’lothin, the elf’s fury grew. Corrupting the memory of his children, twisting it into some hellspawned visage of the elven youth, another of his parents, turning them to fel-charged husks, and again of his wife. The wrath of Kar’storas became manifest against the fiend over and over again, until finally the beast cowed, and Y’lothin was master of his mind and soul, only lesser whispers remained, but still ever-tempting. Such was the path Y’lothin chose.</p>\n\n<p>Sometime later, Kar’storas awoke, blind and weak. He slowly pushed himself into a sitting posture, slumped forward and head bowed. The Illidari simply sat, numbed and damaged, slowly coming to his senses. What felt like hours had passed, Y’lothin’s mind slowly returned, feeling returned as well. He curled his hands, turning them into scaled fists. He’d pause, cold dread creeping up into his stomach as he felt his hands, then his arms; more scales where skin should’ve been. Hands went to shoulders, thicker scales. His hands went to his face; numbs of horns could be felt, then to his forehead, where he found the beginnings of horns. His hands came to his lips, cracked and hardened, and his teeth; three canines where once only one sat on either side of his upper jaw, two where his lower canines were. The mutated elf simply sat, not knowing what to do next, he reflected on previous memories to pass the time.</p>\n\n<p>Hours later, a tending dreg brought forward food to the demonic elf, speaking in a low word. “Eat. You must eat.”</p>\n\n<p>Y’lothin did, reaching blindly forward, his hand pawing at the tray. Once he had found the tray, he’d inch his hand forward for the dish, finding strips of meat, dry tack, and a leather skin of liquid. He’d take the skin and break the seal, or what he assumed was the seal upon it, and drank the water, draining the leather bag whole. Next, he did the same to the meats, eagerly eating the dried meats, he’d then take at the dry tack, much less eagerly eating the tough bread. The hunched dreg silently took the tray and wandered out.</p>\n\n<p>Soon, after the dreg had left, a veteran hunter came into the cell where Kar’storas sat. Y’lothin’s ears perked, looking towards the approaching footfalls, his blind visage peering at the Hunter’s directly. “Stand, Illidari- we bind the demon this morn.” Y’lothin tried to do so. He felt heavier, slower. He came to his feet, stumbling.</p>\n\n<p>“I.. Cannot see.” Y’lothin croaked, reaching dully forward, stumbling into the door frame.</p>\n\n<p>“I will guide you.” The veteran Hunter spoke quietly, a brief tone of sympathy in his graven voice. He took Y’lothin by the shoulder, and guided him.</p>\n\n<p>The duo Illidari made their way down the halls of Karabor, deeper into the bowels of the once holy place. As they walked, streaks of color flickered across Y’lothin’s lack of vision. They arrived within an enclosed chamber, the door closing behind them.</p>\n\n<p>Within the room sat a female kaldorei, another of the Illidari rank. She gestured for Y’lothin to sit, where the tending sin’dorei would aid the newly mutated elf into the laying chair. The blood elf padded Y’lothin on the shoulder. “This is where we will brand you, neophyte, tattoos to bind the demon within. We all have done this, so shall you.” Y’lothin nodded as he rested back. “It will be painful, but it will aid you greatly.” Spoke the graven-toned sin’dorei.</p>\n\n<p>Y’lothin simply nodded again, and braced his body once more.</p>\n\n<p>The pain was immense, a hammer and pen met Y’lothin’s scaled skin. Needle print after needle print of the ebony ink punched into his skin, focusing on his forearms, biceps, shoulders, and collar bone. The process took another several hours as the tattoos were worked into his body. As the tattoos formed, they began to become active, binding into Y’lothin’s demon-fused soul, furthering his control of the fiend that lurked within. As this happened, the black field of nothing that made Y’lothin’s eyes began to shift to a lighter grey.</p>\n\n<p>After the branding, Y’lothin was able to walk more readily, able to hold himself without stumbling much. The veteran sin’dorei deposited the healing Kar’storas into his cell, where the elf would rest for the remainder of the day. Sometime before the fall of the sun, the ghost of sight returned to Y’lothin, only in grey shapes and outline.</p>\n\n<p>Y’lothin began to turn his mind inward, pushing his mind forward into that practiced magical sense. He’d prod at those newly borne tattoos, feeling the arcanic bindings as he held his will teased and prodded across his body, testing the new construction of his internal self. Mutated; but far stronger than a typical specimen of sin’dorei physiology. He turned his magical sense to his body once again, focusing at the aura of energy about him; where once he could find arcane, he found fel. Fel flame broiled in his veins, he noted, but it did not burn him from within. Then, he turned that arcanic magesense to his what remained of them. Felflame burned from those sockets, his remnants of his eyes cleaned and cleared, leaving only burning sockets, hidden away by runecloth. Hours passed, Y’lothin would come to sleep again.</p>",
      "order": 39
    },
    {
      "id": "fic002",
      "title": "Story: The Smile That Couldn't Break",
      "subtitle": "by Jendral Rosepath",
      "date": "January 20",
      "summary_html": "<p>A slight breeze had always seemed to find its way off the falls by Farstrider Retreat. The area around the slightly polished stones seemed nearly unchanged, even after decades away. “I suppose I shouldn’t be surprised. It’s the land of eternal spring afterall.” Jendral chuckled and found a seat amongst the rocks.</p>\n\n<p>\tDrawing had always seemed to come naturally to him, but in this particular place he needed no inspiration. The minutes seemed to bleed into hours as he sat glued to his drawing. A pencil in one hand corrected the stippling while the other prevented the droplet of blood that had formed at the corner of his eye from reaching the page. He took a breath. “It’s the only thing that never takes any less time, no matter how many times I draw it.” Jen spoke aloud to the forest as he looked over the finished piece.</p>\n\n<p>\tIt seemed to be at first glance a gathering of elves in the retreat nearby. A soft backdrop of trees seemed to open up to a crowd. A mixture of shocked and excited expressions littered their faces, each face seeming to capture a moment of raw visceral emotion. In the center of this crowd were two Quel’dorei, One man and one woman clad in Farstrider armor. It was clear by the drawn weapons that a duel had taken place, the woman struck down with a single slash while the man seemed to almost float around her, a sickening expression of joy on his face.</p>\n\n<p>\tJen continued to draw, marking in different details of the surroundings as if it had been burned into his memory. He was so engrossed in his work that the footfalls of a seasoned Farstrider went unnoticed. They walked close to the falls edge, mere feet behind him before Jen heard a voice ring through the silence in his mind. “Halion?” The voice seemed to call out. Jen didn’t want to react or acknowledge the call, but his ears seemed to betray him, wiggling ever so slightly at the name.</p>\n\n<p>\t“No one else uses this spot my friend, not since that da-” The man sighed as he saw what Jen was drawing. “Not since then.” A huff of air escaped his lips as he sat down. She was my sister Hal-”. “Jendral!” He interrupted though he seemed to chuckle after he spoke. “It’s Jendral Rosepath and -no one- else…are we clear?” The man nodded slowly “Right then…Jendral, She was my sister so I know how you feel. It was hard on all of us.”</p>\n\n<p>\tJen seemed to nod but only burst into a fit of giggles. “Falen you were always so…levelheaded.” Jen sighed and looked at the man who only returned the nod. “Besides, it’s not like you can be sad about it can you? The rune probably makes the experience a breeze! Everlasting jo-” Jen held up a hand and looked over to Falen. “I learned something in my time away, a lesson, would you like to know what it is?” Jen turned to face Falen, dusting off his hands.</p>\n\n<p>\tFalen looked as if he was about to continue speaking, but simply nodded with a puzzled look on his brow. “Right then.” Jen began. “Joy is what you make of it. In the beginning, when I was gifted this mark by your sister, I was ecstatic, a more blissful day didn’t exist in my life. I’d had someone that truly wanted nothing more than my happiness.” Jen smiled before a chuckle seemed to almost bounce from his lips. “The thing is, that feeling only grows!” He said in an almost sarcastically excited tone. “You start to really find the joy in -every- little thing. The way the wind shifts, the heat of the sun's rays, why even the pattern in a bugs wings can make your entire day. You get to remember that you don’t have to be sad or angry anymore. You get to leave all of that behind, focus on what really makes you!” Falen nodded along, the curious look never leaving his face.</p>\n\n<p>\t“Once you find that joy, it resonates in everything you do. You begin to get a sense of duty, of purpose in your role in this -glorious city!” Jen giggled and seemed to look about, pointing to imaginary spaces as he told his tale. “Once that sense of purpose is realized, the Farstriders take notice! I mean why wouldn’t they? You seem to always enjoy your job, no matter how bad it gets and you’re always great for morale. But, here’s the thing dear Falen, unbound joy is -just- that…unbound.” Jen took a deep breath and stood, his tone growing more somber as he spoke. “You start to realize that it applies to everything. You escape your first battle without a scratch, but you wound and kill several. The exhilaration is nearly maddening and then it finally hits you. You don’t remember what it’s like to be sad, angry, or even fearful! Everything is either true excitement or nothing. So, what is one to do? Well, they dive into their work. They follow better, they go beyond, they kill as many as it takes. No matter what happens you find yourself at the mercy of your blade!” His ramblings caught up to Falen who seemed puzzled by the ordeal.</p>\n\n<p>\t“You can still back out though Jendral, you had that choice.” Jen simply huffed. “But -why- would I want to? Hm? If everything brings you joy then what’s to -stop- you when you’ve gone too far. When Sadism takes hold, when hurt and being hurt is all the tasks they have for you! Where then, am I supposed to find the joy in life hm?” Jen stood up, rubbing at his temples. The corner of his eye formed another tear of blood that he wiped away. “You don’t understand Falen, this is -all- you know. The warcry of trolls, the breaking of the enemy in front of you. You start taking more dangerous missions, making more reckless decisions.”</p>\n\n<p>\t“Before long you're not just asked to do the dangerous missions, to make the hard calls. The people responsible for you, they try to see -just- how far this rune of yours can go. But, the sickening part? They never just quite find it. You’re taught to question, interrogate, to push people -right- to the brink before they decide to finally tell you what they know. Those who work with you fear you and those who you work -for- well they tolerate you so long as you get results!”</p>\n\n<p>\n\n\t“Hal- J-jen they couldn’t have done something so cruel, by the light we’re in Silvermoon, the Farstriders! They take care of their men…they.” Falen stopped as he thought back. The years that Jen seemed to disappear, for months or even years on end in some cases. His fingers ran through his hair. His breathing hastened as he tried to come to grips with what he was told back then, versus what was being said now.</p>\n\n<p>\t“Exactly! Speechless. They push and push and push, what do we get? Shoved under a carpet somewhere. You’re given a platoon to lead. One that can undertake missions that you deem acceptable. But, what’s really acceptable anymore?” Jen wiped away another bloodstained tear and finally stifled his chuckling. “Everything, you can do anything because if it’s not deemed a suicide mission then it isn’t even getting your blood pumping anymore. After all it's a rush or nothing right? What’s a small three man mission to shut down an entire Amani camp? I mean they’re -your- soldiers. They trust that you know what you're doing but in reality? Ohh you’re so far from it.”</p>\n\n<p>\tJen squatted down to where Falen was sitting and looked at him. “To them you’re a weapon. Someone able to push yourself and others -way- past normal. Your joy is a resource. So then, what happens when the scourge comes knocking, hm? Who do you think they send marching in when the very dead walk these grounds! Not only are you building a small army yourself, but you make -one- mistake. You decide you want the love of your life by your side. You want the person who gifted you such a wonderful thing right there with you to defend this sacred city!” Falen hugged his knees as Jen looked at him. Jen’s expression softened, but only as the bloody tears began to run down his face. “You make a call and she -knows- it will get everyone killed. Or, at least enough that it isn’t worth it, by anyone’s standards. She tries to tell you but, you’re so -convinced- you’re right that you tell her it’s an order.”</p>\n\n<p>\t“What else -can- she do Falen? What else could she do but challenge me?!” Jen began to yell as it seemed the story finally got him to an emotional threshold his rune couldn’t handle. “How could she have known what had happened to me, what I’d become thanks to this accursed rune! She only was doing what was best for everyone, but yes Falen, I suppose I can -only- be happy with it!” Jen grabbed Falen by his shirt to look him in the eye. “Ultimately Falen you’re right, because thanks to this…this curse. Every time I think back. All that I can remember is the sickening joy I felt.”</p>\n\n<p>\tJen took a moment and a deep breath before letting go of Falen’s shirt. “People are a complicated mess of pieces. Tiny shards of themselves that require patience to collect. Getting to know people is picking up these pieces, loving what people can do, what they experience, how they -see- the world. Falen, I loved every single piece that existed when it came to (Name). I loved her wholly and without regret, but when the rune came full circle and the very joy that she gave me became the reason she isn’t here…I…” He tapped Falen on the shoulder. “No, i’m sorry but no, you’ll never know how I feel.” He sighed. “Because as cruel as it sounds…you weren’t forced to enjoy it. There are pieces of myself i’ll never pick up again. I won’t exist in the same way and honestly, if not for the many friends I’ve made over these two decades? I’d more than likely be dead. I’m not coming back to this city as Halion, he’s dead and will -stay- dead. As Jen I can learn to gain control. Perhaps I can even work to fix some of what I broke.” He sighed and patted Falen on the shoulder. “Do what you must, but don’t try to understand something as complicated as joy.”</p>\n\n<p>\tJen didn’t wait for a response, the sketchpad was left by Falen’s side and with a steady but quick pace, Falen was soon a speck in the distance as Jen made his way back towards the city.</p>",
      "order": 38
    },
    {
      "id": "fic001",
      "title": "Story: Limitless",
      "subtitle": "by Kynseria Vel'dinariel",
      "date": "January 18",
      "summary_html": "<p>The marble stones where the priestess kneeled had been scuffed by the battle, but at least the ground beneath them was clean again.</p>\n\n<p>She didn’t know who had sent the flesh golem, and it was eating at her. Curiosity, bewilderment, annoyance. Lithe fingers brushed over the fresh scrapes and imperfections in the marble beneath her doeskin boots.</p>\n\n<p>She had waited for so many years for the ugly reminders of her peoples’ near genocide to be washed away, a fresh beginning for a race too proud to admit to the pain and shame that heavied their hearts and crashed with the waves in their harbors and hid like a lesser metal just beneath the jewels and gilding that covered them like armor. She had waited, and had worked, and had prayed. And almost as soon as the great gray scar of memory had been cleansed and their city rebuilt to near perfection, the marble was scuffed and scraped and marred again. Immediate. Unyielding. Inevitable.</p>\n\n<p>It was probably poetic. But Kynseria wasn’t a poet.</p>\n\n<p>She dusted her hands off on her skirts as she rose, wild blonde curls a halo around her in the midwinter breeze, smiling as warmly as she could at the Blood Knights and the fellow priests who had helped clean up the mess. The remains of the monstrosity were being properly disposed of; no tendrils or traces of unclean magics remained. Patrols would remain heavy for a time to ensure nothing similar happened again. The cleanup team said their words of praise to one another, offered handshakes and salutes and embraces, and those who were free to return to their lives did just that, filtering toward the city or its outlying villages.</p>\n\n<p>Kynseria herself lived far further south–a hefty walk at best when she didn’t take her steed, but she had somewhere to go besides back to the clinic, and the quiet time was good for her mind. She was feeling overwhelmed with memories and an uncharacteristic melancholy.</p>\n\n<p>“Minn’da?” she called out, gently sliding open the door to her mother’s home some twenty minutes later. “You won’t believe who’s in Quel’thalas!” She had stopped by a florist’s stand on her way, and she laid a paper cone full of a lily and snowblossom bouquet upon her mother’s messy makeshift dining table. It was covered from edge to edge with the remnants of her mother’s work: fabric and ribbons, folded and draped, pinned and marked with notes, some dusty and untouched for days. Her brows raised. That sort of mess was unusual.</p>\n\n<p>“Kynsie?” an older feminine voice called out from further inside the sin’dorei-styled cottage. “We’re back here, can you bring the tea?”</p>\n\n<p>The priestess smirked faintly as she reached for a prepared tray off of her mother’s kitchen counter. A teapot full of the very same tea she’d been serving new friends for weeks, the sweet and herbal smell of it familiar and comforting. A grandmother’s recipe, passed down in her family for generations, and now extending beyond them. A medicine for everything.</p>\n\n<p>“Minn’da…?” Kynseria said more quietly, gently pushing open the door to her brother’s room.</p>\n\n<p>The older elven woman sat on a velvet-tufted stool beside a bed that had been neatly made with a two-hundred-year-old silk duvet and a soft fur throw. She held a rag to a younger man’s forehead who reclined restlessly upon it, her own mouse-brown curls tied back into a messy bun that had mostly fallen and sat limp at the nape of her neck, her simple wool dress looking as if it hadn’t been changed in days.</p>\n\n<p>“Minn’da, Light bless, what the fel has happened?” Kynseria rushed the room, setting the tea on the nightstand and pushing her mother out of the way, a hand reaching for her brother’s forehead to feel for a fever, or for magic, or for Light knew what else.</p>\n\n<p>Grayed and violet-eyed, he stared up at her as though there were whole galaxies in his eyes, swirling and searching and never quite finding a spot to land. A broad, handsome smile curved his mouth. He had once been the best of them. “Konrion,” Kynseria breathed out, long blonde brows knitting tightly.</p>\n\n<p>Konrion reached up to gently take her hand from his forehead, staring into her eyes with an expression both too blank and too deep for words. “Kynsie,” he responded musically, squeezing her hand twice before entwining his fingers with hers, and then squeezing again. “Kynnnnzzziieee. Do you see it?”</p>\n\n<p>Kynseria took a breath, squeezing his hand back and sliding to sit on the edge of the bed. Her younger brother, once the apple of their parents’ eye–the heartthrob of their village, with his closely-cropped blonde ringlets and his bright eyes and his sweet smile–gray, ashen, corrupt. What had once been a halo of platinum curls to match his sister’s was a fuzzy mess of ash gray atop his head. His skin was discolored. His eyes were deeply purple. Even his smile, once so wide and warm and sweet, had turned sinister and strange. “What do I see, Kon?” Kynseria asked softly, patting his hand with her free one, as his own continued to squeeze.</p>\n\n<p>“It’s limitless, Kynsie… It’s limitless. Limitless. Limitless…” He licked his dry lips, the smile never fading, though his body lashed out once beneath the covers, his head moving in a particularly unnatural way atop his neck. “Look! Look, it’s there! It’s just there–if you look, just look, Kynsie, it’s limitless, it’s…”</p>\n\n<p>“Shhh…” Kynseria hushed him softly, attempting to calm him enough to stop the movement. She glanced at their mother, who slumped on the stool. “When did this episode begin?”</p>\n\n<p>The elder Vel’dinariel woman shook her head, looking exceptionally tired and unusually old, the tiny lines around her eyes and her mouth far deeper than they had seemed only a few weeks ago. “Four days?” she answered quietly. “I… I don’t know, exactly, I can’t keep track. When he gets like this I–”</p>\n\n<p>“LIMITLESS!” Konrion shouted out, violet eyes wide and staring up at the ceiling, back arching in what would appear to be joyful excitement to anyone who didn’t know the situation. He squeezed Kynseria’s hand so tightly she felt her bones shift. “F'tagh nah'hat! I'mmathan! Sha'lub nahab! Sha'lub nahab!”</p>\n\n<p>The priestess winced and grabbed for the cooled cloth from her minn’da, pressing it to her brother’s forehead and breathing as he settled again. “Shath’yar…” she whispered. “Has he been speaking in Shath’yar this whole time?”</p>\n\n<p>Her mother shook her head. “No. That particular nightmare only began this morning.” She rubbed at her eyes with a fist, stifling a yawn.</p>\n\n<p>“Why didn’t you send for me?” Kynseria asked, the question coming out in a hiss that felt far angrier than she’d meant for it to. Her mother quirked a brow and gave her daughter a look that dared her to hiss again, quieting her anger immediately, even at her hundreds of years old. “I’m sorry, minn’da, but you can’t hide this from me.”</p>\n\n<p>“You have a life, my alah’runel.” Light-darter. A pet name given as a child that had never been retired. Her mother’s voice sagged as much as her body, tired and coarse. “I cannot ask you to come every time Konrion has troubles. They are more frequent, and you have work. What if your brother’s situation were found out upon Quel’Danas, mm?”</p>\n\n<p>“They would… understand, minn’da, they would only ban Konrion, I would be fine–”</p>\n\n<p>“You would be dismissed, and this passion that you’ve spent your life working toward would be gone. You would be a liability. Dangerous.” She paused, a trembling hand lifting to rub the back of her neck. “We all would. We aren’t blessed with a noble name to shield us, who would care?”</p>\n\n<p>Despite the protestations that begged to be given voice, there was no arguing with her mother. Kynseria frowned deeply, swallowing a knot in the back of her throat. “No one will find out. And we’ll fix this.” She gazed into her mother’s blue eyes, searching them for any sign of hope. “We’ll fix it. Somehow.”</p>\n\n<p>Her mother snorted and rose from her stool, bones crackling as she stretched. “Umbric’s team couldn’t fix it, or Kon wouldn’t have ended up back here. Yet here we are.” She hugged her middle. “Can you stay long enough for me to take a bath?”</p>\n\n<p>Reassurances of both a bath and sleep quieted her mother enough for the older woman to wander elsewhere in the house. The clinic would simply have to be closed tonight.</p>\n\n<p>Kynseria squeezed her brother’s hand again and gently moved to lay next to him over the duvet, her head upon his shoulder, blonde curls cascading. Her knees curled up next to his hip. She hugged his middle and fought the stinging onset of tears as it threatened her eyes.</p>\n\n<p>“Limitless, Kynsie!” Konrion whispered to her, smiling broadly to the ceiling again. “Limitless… Uq naggwa…”</p>\n\n<p>Kynseria squeezed him and nodded, wiping a tear away before it could wet the silk duvet. A vision of a little blonde boy with a mop of ringlets like sunshine beamed at her from her mind’s eye. “Of course,” she answered. “Limitless. Do you know who I saw, Kon?”</p>\n\n<p>“It doesn’t end… Athu'gag magg'naggwa. Qor'naus'agth lwhuk. Lilth gag'huqth'hoq… It doesn’t…”</p>\n\n<p>Kynseria sniffled. “I saw Haldarin Autumnveil. Do you…” She wiped a tear away with the back of a sleeve. The sound of her mother filling her tub echoed down the hall, a tiny comfort. “Do you remember the Autumnveils, Kon? They helped with money for our schooling.”</p>\n\n<p>“A-autumn…” Her brother repeated, his smile falling only a little, the gray-blue skin of his brow furrowing. “Hald… Hald… b-break…”</p>\n\n<p>“That’s right. He was a Spellbreaker.” She squeezed him gently again and nodded. “See? You’re still in there, aren’t you?” Visions of letters she’d received detailing the expedition, begging her to accompany him. It was his chance to prove himself, to become more than the low-talent arcanist he’d always been. “You’re just a little confused right now, that’s all.”</p>\n\n<p>“That’s all,” he repeated, his voice sounding far more tired. “It’s limitless, Kyns…” He yawned, his eyes drooping.</p>\n\n<p>“It is, Kon. It’s limitless. But we’re going to get you back to us, I promise.”</p>\n\n<p>She dared not move, knowing the weight of her body next to him soothed him. The letters danced in her mind. He had begged for weeks for her to go with him.</p>\n\n<p>Eventually… she had agreed. Kynseria wondered what would have happened had she actually gone to Telogrus.</p>\n\n<p>As his breathing dropped into a quiet snore, he stopped squeezing her hand.</p>",
      "order": 37
    },       
    {
      "id": "campaign2",
      "title": "Campaign: Shadow of the Exiles",
      "subtitle": "Long Narrative Campaign",
      "date": "c. Year 42",
      "summary_html": "<p>The Fellowship delves deep into ancient dating back to the founding of Quel'Thalas, when Highborne exiles braved the perils of Tirisfal and the Amani Empire's dominion in order to find a new home. Something stirs from that time, ever present, and finally seeing its chance to rise once more.</p>",
      "order": 36,
      "entries": [
        {
          "id": "campaign2.1",
          "title": "Event: Puzzle Box of Kel'shunar Starfall",
          "date": "January 18 & 20",
          "summary_html": "<p>Members of the Fellowship gather to delve into the mysterious locked seal sitting atop an ancient elven chest, one once belonging to the Kel'shunar Starfall, an early founding member of the Kingdom of Quel'Thalas who was exiled from Kalimdor. Faeylli Nuth'danil, Ansinosth Summerbough, Tal'theas Sunfeather, Gwaeloth Songwood, Thalendir Dawncrest, and ASH gather through the  night and work to break several magical sealed bound by riddles, each associated with various conceptional understandings of the schools of magic, and on the second day manage to unlock the container and recover an ancient elven tome.</p>"
        }
      ],
        {
          "id": "campaign2.2",
          "title": "Story: Studies of Leyspire",
          "subtitle": "by Silanni Leyspire",
          "date": "January 26",
          "summary_html": "<p>Silanna Leyspire stepped into the Crescent Librarium without a word. Her footsteps echoed on marble that had stood up to the test of time. Suramar’s scholars talked about preservation, but here, knowledge was more than just stored. It was chosen. Arranged. Weighed.</p> <p>She carried no relic, no prize wrapped in true-silver. Only a few vellum sheets, copied with care. Just a handful of pages, but they weighed more than any artifact.</p> <p>The Fellows gathered as she laid the pages on the table and smoothed them flat. Ink dots stared up at her, some linked by thin lines, others left alone. No words. No clues. This was a test, not an error.</p> <p>Silanna stayed when the others left. The quiet settled in, the kind that only comes when it’s just you and the books. She lined up the pages, dots and lines waiting for her to find meaning. She would not rush. It was easy to see patterns that weren’t real. She would not let herself fall for that.</p> <p>At first, the markings meant nothing. No axes, no scales, nothing like any map or star chart she knew. Maybe constellations, but the patterns were too neat, too careful. Stars never lined up that well.</p> <p>She found some old diagrams on the restricted shelves, the kind no one bothered with anymore. Most were older than the Sundering, and even the experts barely understood them. They didn’t match her pages, not quite, but the way they worked felt familiar. These diagrams showed connections, not places.</p> <p>Silanna adjusted a faint arcane overlay, careful not to let the magic take over. A few points reacted, just enough to notice. The results were uneven and faint. Not proof. But worth thinking about.</p> <p>She wondered if it was ley lines, or something like them.</p> <p>If this was a map of ley lines, it was nothing like the neat diagrams arcanists used now. The old Highborne saw ley energy as pressure points and crossings, not just lines. The oldest texts said Tirisfal, before the Sundering, was different. Full of magic. Tangled. Messy.</p> <p>That alone wasn’t proof.</p> <p>But when she compared the copied pages to old records from the first years after the exiles landed in the Eastern Kingdoms, the connections were hard to ignore. The ley energies there were strong enough that the Highborne noticed them as soon as they arrived. Later, as they began tapping into the magic, some encountered darker energies that drove them to madness.</p> <p>It still wasn’t proof. But it was hard to ignore.</p> <p>Silanna closed her folio and leaned back. If Kel’sunar Starfall had tried to map the ley lines in Tirisfal, it would have been dangerous. Maybe that was why there was no explanation, and why the book was sealed with magic. Maybe the chart was meant to be read with the land itself, not just on paper.</p> <p>She couldn’t be certain. There were still gaps. Maybe there was another answer.</p> <p>But if she had to guess, she exhaled quietly.</p> <p>Ley lines seemed the best answer.</p> <p>Silanna gathered the pages and locked them in a warded folio. The Crescent Librarium held more to review: old expedition logs, letters, and forgotten surveys. She would start there; ninety percent sure was enough to keep going.</p> <p>She could worry about being certain later.</p>"
        }
      ]
    },
    },
    {
      "id": "event009",
      "title": "Event: Ghostlands: Gorehaunt",
      "subtitle": "January 16",
      "date": "c. Year 42",
      "summary_html": "\n The Fellowship responds quickly to reports of a long-since-missing Scourge abomination, Gorehaunt, emerges in southern Quel'Thalas. One of the Scourge's most terrible flesh abominations used during the Fall of Quel'Thalas, it vanished after the fighting and has since eluded the kingdom's defenders. <p>Now in sight once more, and seemingly on a mission to use the corrupted artifact embedded at its core--the Heart of the Bough--to spread sickness throughout the woodlands, the elves rush to eliminate the threat. <p>Joining forces with the Sin'dorei Blood Knights, Farstriders, and the Magisters of Silvermoon, Fellows Alen'dris Sunblossom, Kynseria Vel'dinariel, Lady Thalena Thori'zaram, Gwaeloth Songwood, Jeshacinin Evertrail, Velara Clarke, Sable Than'rune, and Ansinosth Summerbough deploy and make a stand at the Elrendar River crossing where they battle against Gorehaunt. In the end, after a long winded battle, they manage to fell the abomination and destroy the corrupted heart buried within.\n",
      "order": 35
    },
    {
      "id": "event008",
      "title": "Event: Magical Mystery",
      "subtitle": "January 10",
      "date": "c. Year 42",
      "summary_html": "\n A disturbance within the Fellowship's sanctum prompts its members to investigate and resolve the matter swiftly, before things spiral out of hand. Responding swiftly, Master Sorcerer Ansinosth Summerbough, Gwaeloth Songwood, Tal'theas Sunfeather, Jeshacinin Thekiel, and Kynseria Vel'dinariel uncover the truth that a collection of tomes-recently transferred to the sanctum from Magistry Sanctums within Silvermoon City-in fact contained a trio of unruly novice mages who had been punished by means of hexing; their instructor, Master Semnalor, transformed them into the same text books the novices had so foolishly disregarded. While such punishments-including Polymorphing-are not atypical, in this particular case of hexing the punishment was rendered just before the death of the Magister, leaving the novices trapped with no knowledge of their whereabouts. The three novice mages, Haydal'an, Kelvath, and Sen, are successfully rescued and counseled through the rude awakening of the past twenty years of their lives, which they missed.\n",
      "order": 34
    },
    {
      "id": "midnightprelude",
      "title": "Lore: Resurgence of the Radiant Song",
      "subtitle": "'Expansion: Midnight'",
      "date": "c. Years 42",
      "summary_html": "\n Across Azeroth, a growing number of citizens begin to suffer the increasing pangs from what is known as the Radiant Song, believed to be a warning call from the world of Azeroth itself. Some of those experiencing these visions report having begun to see visions of the Kingdom of Quel'Thalas as a focal point of the song.\n            ",
      "order": 33
    },
    {
      "id": "event007",
      "title": "Event: Fellow's Soirée",
      "subtitle": "January 8",
      "date": "c. Year 42",
      "summary_html": "\n To celebrate the new year and new horizons, the Fellowship hosts a soirée within its sanctum-once the estate of Ansinosth Summerbough-with guests from from and wide.\n",
      "order": 32
    },
    {
      "id": "event006",
      "title": "Event: Arcane Anomaly",
      "subtitle": "September 26",
      "date": "c. Year 42",
      "summary_html": "\n Fellows of the order-including High Sorcerer Aelendan Shatterstar, Haverstead Brightspear, Quely Phoenixheaert, Kindrith Windstalker, Hal'sonas Windreaver, Talis Lightbrook, and Soryn Cloudspire-respond to an anomaly spiraling out of control to the west of the Sunwell Plateau. Joining forces with members of the Magisters, the Fellowship's members identify a clot impacting the ley lines, which they purge and nulify the aberrant anomalies spawning off of it. The occurance, though handled, raises questions about what could have caused a clot in the ley lines.\n            ",
      "order": 31
    },
    {
      "id": "event005",
      "title": "Event: Spectral Sabotage",
      "subtitle": "September 15",
      "date": "c. Year 42",
      "summary_html": "\n Fellows of the order-including Magister Vileon Stormwrath, Dkakiavis, Alindriel, Merivis, Priestess Menadrael Embermourn, Kalandoril, Greymourn, and Kodestre-pursue a group of outsiders through the Ghostlands and into Goldenmist Village wherein they discover an unusual barrier.</p><p>Investigating further to discern the nature of the barrier and its connection, they uncover its illusionary origins and manage to breach it, only to find the slain Magister Sunstrife, as well as a portal to the plaguelands through which the outsiders escaped.</p><p>Now on the trial of the murderers, the Fellows continue to pursue leads.\n            ",
      "order": 30
    },
    {
      "id": "event004",
      "title": "Event: Missing Mistmaker",
      "subtitle": "September 11",
      "date": "c. Year 42",
      "summary_html": "\n On behest of the Magistry of Silvermoon, Magister Vileon Stormwrath leads a party of Fellowship members-including Priestess Menadrael Embermourn, Soryn Cloudspire, and Hesparius Greymourn-to recover an artifact known as the Mistmaker, which had been stolen. Encountering bandits disguised as Sunfury renegades working in concert with a tribe of local naga, the fellows intervened before any exchange could be completed, slaying the naga and ensuring the capture of the bandits.\n            ",
      "order": 29
    },
    {
      "id": "event003",
      "title": "Event: Construct Deconstruction",
      "subtitle": "September 4",
      "date": "c. Year 42",
      "summary_html": "\n To better prepare for future tasks and ventures, Magister Vileon Stormwrath leads several fellows of the order in tactical exercises and practice just outside of Silvermoon, including Hespir Everwyern, Zanrolia Sprenlen, Llorial Solcrest, Falthuron Evermist, Menadrael Embermourn, Hesparius Greymourn, Soryn Cloudspire, Lamplighter Kharyym, and Alindriel Brightward. \n            ",
      "order": 28
    },
    {
      "id": "event002",
      "title": "Event: Necrotic Nightcall",
      "subtitle": "August 25",
      "date": "c. Year 42",
      "summary_html": "\n Following the arrival of word that several Farstriders were murdered in the Ghostlands and that foul magic may have been at play, several members of the Fellowship, and their allies, venture out into the southern woodlands in the dark of night and pursue the trail to the Sanctum of the Moon. There, the fellows encounter shrouded figures working necromantic magics and attempting to open a portal to summon forth the death. <br><br> Andrys Blackthorn, Menadrael Embermourn, Hesparius Greymourn, and Magister Vileon Stormwrath battle the sinister cultists and undead, though are unable to prevent the escape of one as a monstrous Abomination is summoned through the portal. <br><br> Given the gruesome nature of the Farstriders' deaths, it is concluded that the Abomination was responsible, and while it was slain in the battle, the cult's leader remains at large.\n            ",
      "order": 27
    },
    {
      "id": "tww",
      "title": "Lore: Fall of Dalaran & the Void War",
      "subtitle": "'Expansion: The War Within'",
      "date": "c. Years 41-42",
      "summary_html": "\n The void entity known as Xal'atath, once Harbinger of the Void Lord Dimensius, launches a bold assault on Dalaran after luring the mages and their allies to the isle of Dornogal, \nan ancient Titan stronghold beyond mortal reach for ages. Springing her trap once the magi-led coalition arrives with the aid of the Dark Heart, Xal'atath destroys the city of Dalaran, stranding the survivors, \nand in the process ignites a fierce conflict between the defenders of Azeroth and the void itself. During the fighting, the descendants of the ancient Arathi bloodline are discovered deep beneath\nthe earth in the vast caverns below the isle, and the half elven holy warriors commit their numbers to the cause of driving back Xal'atath and her nerubian \narmies. \n<br/>\n<br/>\nDespite the victories achieved against the sinister forces at work on the Isle of Dornogal and the caverns below, a call from the Locus-Walker, mentor to Ranger-Captain Alleria Windrunner,\nsummons the defenders of Azeroth to K'aresh, once home to the Ethereals. It is learned that a sect of the Ethereals known as the Shadowguard under the leadership of a resurrected Nexus-King Salhadaar,\nare working to resurrect the void lord Dimensius, the All Devouring. Facing limited options and certain doom should the void lord's return not be halted, the defenders of Azeroth\nforge a pact with Xal'atath and coordinate their efforts alongside the Locus-Walker and his allies to halt the rebirth of Dimensius. <br><br>Despite their success, Xal'atath is able to escape to\nplaces unknown, and now with a fraction of the decimated void lord's essence for her own consumption and use. A scant few members of the Elrendar Fellowship are counted among the forces who journey to K'aresh, their intent being to pursue further knowledge of the void with the aim of countering the danger posed by void corrupted entities. \n            ",
      "order": 26
    },
    {
      "id": "campaign1",
      "title": "Campaign: What Lurks in the Shadows",
      "subtitle": "Short Narrative Campaign",
      "date": "c. Year 42",
      "summary_html": "<p>The Fellowship is called upon by the Magister Zaedana of Silvermoon to pursue leads on a dire, growing threat: the presence of fel taint within two arcane sanctums across Quel'Thalas. Though the Magisters of Quel'Thalas are well capable themselves of investigating such a task, the greater threat is revealed to be the suspect of a traitor within the ranks of the Magistry itself. <br><br> Tasked with getting to the bottom of the matter swiftly, the Elrendar Fellowship faces a daunting task of investigating the very officials who mandate the practice of magic throughout the High Home, and pursuing leads on somethingi that could prove terribly lethal to all.</p>",
      "order": 25,
      "entries": [
        {
          "id": "campaign1.1",
          "title": "Event: The Two Vaults",
          "date": "September 6th",
          "summary_html": "<p>The Fellowship and its allies pursue an investigation into a potential traitor within the magistry, and the breaches at arcane vaults deep in the Eversong Woods. Andrys Blackthorn, Soryn Cloudspire, Selindel of Gilderhollow, Lady Menadrael Embermourn, Kodesetre, Hesparius Greymourn, Alen'dris Sunwalker, Lady Thalena Thori'zaram, Lady Zanrolia Sprenlen, Lamplighter Kharyym, Knight-Lord Caledeth Bloodthorn, Falthuron Evermist, and Hal'sonas Windreaver venture deep into one of the vaults, and after a painstaking effort to purify shattered soul fragments found at the wrecked vault, they uncover the truth of a demonic threat-one of the Nathrezim has found their way into Quel'Thalas.</p>"
        },
        {
          "id": "campaign1.2",
          "title": "Event: The Third Vault",
          "date": "September 7th",
          "summary_html": "<p>Following the revelations the day prior, the Elrendar Fellowship makes preparations to respond to the dire threat, but is urgently summoned following another disturbance at the Sala'dashal vaults in southern Eversong Woods.</p>"
        },
        {
          "id": "campaign1.3",
          "title": "Event: The Handoff",
          "date": "September 15th",
          "summary_html": "<p>With the disturbance investigated and determined to be a substantial lead in the case of the traitor, the Fellowship dispatches some of its members to draw out the traitor with a trap, exposing them, and eliminating the threat.</p>"
        }
      ]
    },
    {
      "id": "dragonflight",
      "title": "Lore: The Primalist War",
      "subtitle": "Expansion: Dragonflight",
      "date": "c. Years 40-41",
      "summary_html": "\nWith several years of quiet at long last found on Azeroth, the Sin'dorei hasten their efforts to purge Quel'Thalas of the Scourge's taint, and to rebuild the once glorious High Home. On land far away, though, an awakening had begun; the ancient proto-dragons known as the Primal Incarnates. These massive, vengeful dragons break free from their imprisonment for the first time since the slaying of Galakrond, and set themselves to the destruction of the Dragonflights, whom they see as traitors to dragonkind. <br><br>Painful revelations rise about the transforming of the proto-drakes of old and their eggs into the evolved dragons known today, all made possible through the twisting magic of the Titans, through Keeper Tyr. Viewing this forced transformation as a violation of their free will, the Incarnates rebelled, and for that they were imprisoned. Now free, they renew their war against the dragonflights, and in the process deliver unto Xal'atath, the herald of Dimensius, the All Devouring, an artifact known as the Dark Heart. Imbued with the power of Galakrond's sinister essence, the void entity flees, leaving the dragons to their war, which strangles the Dragon Isles from shore to shore. <br><br>During the epic battles, the Kaldorei plant and grow the new World Tree, Amirdrassil, and settle many of their displaced survivors beneath its boughs. Though the primalist's war ends with the defeat of the Incarnates, the revelations and confrontations prompt the aspects to reassert their dedication to safeguarding Azeroth, once again assuming the mantle of responsibility for its protection.\n      ",
      "order": 24
    },
    {
      "id": "rebirth",
      "title": "Lore: Emergence of the Fellowship",
      "subtitle": "Guild History",
      "date": "c. Years 40-42",
      "summary_html": "\nWith tensions still at an all time high following the unfathomable bloodshed of the Fourth War, surviving members of the reforged Fellowship convene a gathering and elect to step out from\nobscurity and embrace a more public role in guiding the future of elven kind. Some of the last remaining neutral-leaning forces of Thalassian kind, the leading members of the cohort begin to\nreach out to both the Sin'dorei, the Quel'dorei, and the Ren'dorei, aiming to begin building more open lines of communication and securing open visitation privileges for the other members of\nthe cohort.\n<br/>\n<br/>\nAs the conflict on the Dragon Isles raged, the Fellowship set its focus to shoring up holdings across Quel'Thalas, and renewed its efforts to rebuild throughout the southern landscape where \nmany vaults and sanctums had once stood. Even with animosity still ripe between the factions, the Fellowship manages to keep peace within its own ranks.\n      ",
      "order": 23
    },
    {
      "id": "shadowlands",
      "title": "Lore: Windrunner Legacy",
      "subtitle": "Expansion: Shadowlands",
      "date": "c. Year 35",
      "summary_html": "\n The pursuit of Sylvanas Windrunner by both factions leads in her capture, and, if rumor is said to be true, the return of her soul to her body-with the fragments of it having been severed years prior by the blade of the Lich King. It is unclear what the fate of the Banshee Queen is, but legacy of the Windrunners persists in both Vereesa and Alleria Windrunner, though both remain in exile from Quel'Thalas. \n      ",
      "order": 22
    },
    {
      "id": "bfa",
      "title": "Lore: Fourth War",
      "subtitle": "Expansion: Battle for Azeroth",
      "date": "c. Years 33–34",
      "summary_html": "\n Horde Warchief Sylvanas Windrunner launches a devastating first strike against the Alliance in response to a failed assassination attempt against her during the conflict against the Legion, burning the World Tree Teldrassil to a husk and perpetuating a genocide against the Kaldorei living within it. With the world once again plunged into a chaotic and bloody war, the Sin'dorei are pitted against Quel'dorei and Ren'dorei in open conflict, alongside the rest of the Alliance and Horde. <br><br> The war proves to be one of the most bloody in history since the War of the Ancients, with entire cities and townships razed to the ground and populations put to death enmass. As had occured years prior, the Horde once again splinters under internal pressure as infighting shatters the faction's unity, leading to another pact of desperation with the Alliance in an effort to overthrow the warmongering Banshee Queen, Sylvanas Windrunner. <br><br> The war culiminates in the second Siege of Orgrimmar, which ends with the Banshee Queen's defection and flight. Despite the end of the conflict, and a serious effort at forming a lasting truce, hostilities between the elven people prove themselves too deep to mend. \n      ",
      "order": 21
    },
    {
      "id": "voidelf",
      "title": "Lore: Rise of the Ren'dorei",
      "subtitle": "Expansion: Legion",
      "date": "c. Year 32",
      "summary_html": "\n During the final year of the conflict against the Burning Legion, numerous Sin'dorei under the leadership of Magister Umbric seek out the forbidden research of an elven necromancer-and traitor to the Kingdom-Dar'Khan Drathir, in a bid to better arm themselves against the enemies of the kingdom. This proves to be a dire calamity that nearly corrupts the ambitious elves. <br><br> Tayan’adara Autumnbloom, one of the earliest members of the Fellowship who was presumed lost beyond a void rift ages prior, emerges at last, having sensed the corruption of the elves like a beacon amongst the cosmos. Arriving to aid them, she is caught up in their transformation. <br><br> Through the intervention of the void-touched Ranger-Captain Alleria Windrunner and her mentor, the Locus Walker, these elves are saved and taught to control the dark powers they had embraced, transforming them into the <em>Ren'dorei</em>, or Children of the Void. For their seeming betrayal of the edicts of the Regent Lord, the Ren'dorei are exiled from Quel'Thalas by the Sin'dorei, and are driven to seek shelter amongst the Alliance under the leadership of Magister Umbric and Ranger-Captain Alleria Windrunner. \n      ",
      "order": 20
    },
    {
      "id": "legion",
      "title": "Lore: Return of the Burning Legion",
      "subtitle": "Expansion: Legion",
      "date": "c. Year 32-33",
      "summary_html": "\n The Burning Legion launches its third invasion of Azeroth, this time through a portal opened within the depths of the Tomb of Sargeras. The chaotic onset of the war plunges Azeroth into Chaos, leading both the Sunreavers and Silver Covenant, along with the Quel'dorei and Sin'dorei populations to fully commit to a war footing. During the conflict, the ancient Highborne elves of Suramar-now known as the <em>Shal'dorei</em>, or Children of Night. <br><br> During the conflict, the defenders of Azeroth defeat Kil'jaeden the Deceiver-would be despoiler of the Sunwell during the conflict against Prince Kael'thas Sunstrider years prior-and later invade the world of Argus, home to the Burning Legion. There, the elven forces are reunited with Ranger-Captain Alleria Windrunner and her husband, the human General Turalyon, both who had vanished beyond the Dark Portal with the Alliance Expedition over twenty years prior. Strengthened by the forces of the Army of the Light, of which Turalyon and Alleria are a part, the allied forces bring an end to the Burning Legion once and for all.  \n      ",
      "order": 19
    },
    {
      "id": "event001",
      "title": "Event: Time Lost Trial",
      "subtitle": "July 16",
      "date": "c. Year 32",
      "summary_html": "\n The Fellowship intervenes as a neutral party in a race between the Sin'dorei and Quel'dorei to investigate a time rift, from which a familiar arcane signature has been detected. It is discovered that beyond the rift, survivors of the long-lost Alliance Expedition are trapped within an anomaly within the Twisting Nether. Near-completely frozen in time, for the elves of the Expedition only mere moments had passed since they escaped the destruction of Draenor, which in reality had been over two decades. Both Silver Covenant and Sunreaver forces, and members of the Fellowship, race to unwind the anomaly and rescue the stranded elves, though tensions erupt in the wake of the rescue as both factions vie for the loyalty of the survivors. The Fellowship is able to mediate the discord and helps to resettle the survivors.\n",
      "order": 18
    },
    {
      "id": "wod",
      "title": "Lore: Hellscream's Vengeance",
      "subtitle": "Expansion: Warlords of Draenor",
      "date": "c. Year 31",
      "summary_html": "\n Garrosh Hellscream, through the aid of rogue agents of the Bronze Dragonflight, secures the aid of orcish forces from an alternate timeline, and launches an invasion of Azeroth to seek vengeance upon those who deposed him. The allied forces of Azeroth counter assault through the Dark Portal and defeat the Iron Horde, but fail to secure an alternate version of the orcish warlock Gul'dan from escaping to Azeroth, where he opens a new invasion portal for the Burning Legion. \n      ",
      "order": 17
    },
    {
      "id": "cataclysm-mop",
      "title": "Lore: Purge of Dalaran",
      "subtitle": "Expansion: Cataclysm & Mists of Pandaria",
      "date": "c. Years 27-31",
      "summary_html": "\n All out war between the Horde and Alliance engulfs the world, even admist the ongoing crisis of the reemergence of the once-warder of the earth, the black dragon aspect now known as Deathwing. <br> <br> Chaos and destruction rage across the world, and the elven tribes are thrust against one another in open conflict. After two years of bloody fighting, Deathwing is slain, but the conflict between the Horde and Alliance only deepens. During the third year of the conflict, the Kirin Tor enact a purge of the Sin'dorei from the city under the command of Lady Jaina Proudmoore and Silver Covenant Ranger-General Vereesa Windrunner following the Sunreaver's use of then-neutral Dalaran to infiltrate an Alliance city and steal a powerful artifact known as the Divine Bell. The purge is a watershed moment for the elven people, shattering any hope of reconcillation between the tribes and sparking a deep running blood feud that persists even to this day. <br><br> After four long years of war, the Horde splinters under the pressure of civil strife, and both the Sunreavers and Silver Covenant form a rare, unified front to overthrow the Horde Warchief Garrosh Hellscream. Despite the show of unity, animosity lingers. The Horde and Alliance secure a tenuous armistice, but no lasting peace. Throughout the entirety of the conflict, the Elrendar Fellowship officially maintains a neutral stance, though some of its individual members are drawn into the fighting, fueling a tense atmosphere within the cohort's ranks. <br><br> Despite this, open bloodshed amongst members is avoided, and the surviving leadership begin to face serious doubts about the viability of the Fellowship's longevity given the seemingly insurmountable tension. \n      ",
      "order": 16
    },

    {
      "id": "elrendar",
      "title": "Lore: Reformation of the Fellowship",
      "subtitle": "Guild History",
      "date": "c. Year 27-Present",
      "summary_html": "\n With the escalation of hostilities and conflict across the world, surviving members of the Order try desperately to bring a halt to the conflict between the branches of Thalassian elves, to no avail. Despite this, numerous surviving magisters, mages, arcanists, warlocks, scryers, priests, and other magically-inclined individuals flock to the ranks of the Order, helping to reestablish it and, at least as best as can be achieved, help to mediate the conflict between elven kin.  \n      ",
      "order": 15
    },
    {
      "id": "wotlk",
      "title": "Lore: The Sunreavers, the Lich King & the Nexus War",
      "subtitle": "Expansion: Wrath of the Lich King",
      "date": "c. Year 27",
      "summary_html": "\n The azure dragons of Azeroth launch a war against magic users the world over after the crazed blue aspect Malygos declares mortals unfit to wield the magics his flight was given dominion over. This dire conflict leads the Magistry of Silvermoon to seek amends with the Kirin Tor which imprisoned and persecuted the elves years prior. Magister Aethas Sunreaver, once an archmage of the Kirin Tor, advocates and secures the admission of the Sin'dorei into Dalaran as a new order-the <em>Sunreavers</em>-which is starkly opposed by the surviving Quel'dorei of Dalaran who promptly assemble a new order in opposition, the <em>Silver Covenant</em>. Despite the tension between the Horde and Alliance forces, the Kirin Tor manages to establish itself as a neutral force able to mediate their contributions. <br> <br> Soon after the outbreak of the Nexus War, the Lich King launches an assault upon the mortal cities across the globe, seeking to snuff out the living once and for all. Both the Horde, Alliance, and Kirin Tor launch a full on invasion of Northrend to confront the Lich King, aided by the Argent Crusade-formed of the Argent Dawn and Order of the Silver Hand-and the recently liberated death knights who form a new cohort called the Ebon Blade. <br><br> The war in Northrend exacts a bloody toll from the defenders of Azeroth, and though both Malygos and the Lich King are slain, it comes at the cost of renewed conflict between the Alliance and Horde as internal betrayals spiral and a brutal massacre claims the lives of scores of valiant heroes from both sides. The conflict between the Horde and Alliance persists even after the death of Prince Arthas-the despoiler of Quel'Thalas. A new Lich King is seated to control the remaining undead and prevent further calamity.  \n      ",
      "order": 14
    },
    {
      "id": "tbc",
      "title": "Lore: Fall of the Prince",
      "subtitle": "Expansion: The Burning Crusade",
      "date": "c. Years 25-26",
      "summary_html": "\n Following Illidan Stormrage's ever expanding occupation of the Outlands, the Burning Legion lures the defenders of Azeroth into storming through the Dark Portal and confronting Illidan, casting the Sin'dorei into a state of chaos as their ranks-now in service to the Horde through a pact secured by Regent Lord Lor'themar Theron-are pitted against the increasingly volatile and unstable forces of Prince Kael'thas' Sunfury armies. <br><br> Civil war breaks throughout the surviving elven diaspora, leading to an ultimate confrontation in the Netherstorm, and then the Isle of Quel'Danas, where Prince Kael'thas-now driven to madness through consumption of fel magic-is confronted and finally slain after he tries to summon a demon lord through the Sunwell. <br><br> The final confrontation on the Isle of Quel'Danas marks the second time in a decade that an outside force has stormed the Sunwell Plateau and assaulted the well, though this time the corrupted, broken well is reborn through the willing sacrifice of a naaru. \n ",
      "order": 13
    },
    {
      "id": "classic",
      "title": "Lore: Descent into Madness",
      "subtitle": "Expansion: Classic WoW",
      "date": "c. Years 22-26",
      "summary_html": "\n Prince Kael’thas sworn loyalty to Illidan Stormrage opens new avenues for the elven recovery; Silvermoon City is rebuilt through a show of tremendous magical might, and the elves begin to claw back control over the Kingdom inch by inch; the Sin’dorei Sunfury forces subdivisions (Sunfury, Sunhawks, Eclipsion, Firewing, Illidari, etc.) proliferate; fel magic becomes a substitute for lost Sunwell energies for many, while others refuse it. <br><br> In this time, Prince Kael'thas leads the Sunfury forces in following Illidan Stormrage back to Azeroth to confront the growing power of the Scourge in Northrend, only to fail. Numerous elves are slain, including Lana'thel-wielder of the legendary blade Quel'delar-who is raised into undeath by the Lich King to serve as Blood Queen of the San'layn, vampiric undead elves. <br><br> Following their defeat, Illidan and Kael's Sunfury army retreats to the Outlands where they work to secure their control over the shattered world. At some point during these years, Prince Kael'thas Sunstrider begins to fall deeper into a madness that would eventually lead him to accept a bargain with the demon lord Kil'Jaeden, the Deceiver.\n      ",
      "order": 12
    },
    {
      "id": "schism",
      "title": "Lore: Rise of the Sin'dorei",
      "subtitle": "Game: Warcraft III",
      "date": "c. Years 21-22",
      "summary_html": "\n Prince Kael'thas Sunstrider leads the Sin'dorei in pursuit of aid from the human kingdoms, only to face persecution and inprisonment by the xenophobic survivors of the fall of Lordaeron. Forced to make desperate alliances, the Prince joins forces with the naga sea witch Lady Vash'j and her master, Lord Illidan Stormrage. Through Illidan, the Sin'dorei learn to consume fel energy as a substitute for the arcane, something which drives a wedge amongst the survivors. <br><br> Grand Magister Rommath-at the behest of Regent Lord Lor'themar Theron, who rules in Prince Kael'thas' stead-expels the dissidents who refuse to embrace the new elven identity, leading to a schism between those calling themselves Sin'dorei, and those who cling to the ideals of the Quel'dorei who ruled before the fall. The crackdowns and exile lead to a flight of elves to the human realms, as well as parallel enlistments to the Outlands under Prince Kael'thas' forces who delve further into the darker practices. <br><br> Through this division, the Elrendar Fellowship remains impartial, focusing instead on regathering its strength and preserving and securing the dangerous magical knowledge from its vauilts now in the hands of the Scourge.\n",
      "order": 11
    },
    {
      "id": "fallqt",
      "title": "Lore: Fall of Quel’Thalas (Third War)",
      "subtitle": "Game: Warcraft III",
      "date": "c. Years 20-22",
      "summary_html": "\n Following the corruption plaguing of Lordaeron, the fallen Prince Arthas Menethil leads an army of the dead through the Greenwood, breaches the Elfgates of Quel'Thalas, and plunges the kingdom into darkness. Some ninety percent of the elven populace of the kingdom is either slain and left to rot, or raised into undeath. As further insult, Prince Arthas defiles the Sunwell as a means to raise a powerful servant of the Scourge into undeath as a Lich, leaving the powerful font of magic tainted. <br><br> Silvermoon is devastated; Ranger-General Sylvanas and Grand Magister Belo’vir Salonar, and King Anasterian Sunstrider are all slain, and the Ranger-General is raised into undeath as a Banshee. Some survivors scatter, and others struggle to regroup. The Sunwell’s loss, and its eventual future renewal, reshapes Thalassian destiny. Elven Prince Kael'thas Sunstrider elects to destroy the Sunwell to prevent the corruption of the surviving people, and proclaims a new identity for his people-thus comes the birth of the <em>Sin'dorei</em>, the Children of Blood.\n          ",
      "order": 10
    },
    {
      "id": "expedition",
      "title": "Lore: The Alliance Expedition",
      "subtitle": "Game: Warcraft II",
      "date": "c. Year 8",
      "summary_html": "\n Following yet another incursion by the Horde into Azeroth through a reopened Dark Portal, Farstrider Ranger-Captain Alleria Windrunner joins the human General Turalyon, the dwarven thane Kurdran Wildhammer, the Kirin Tori archmage Khadgar, and the human Trollbane descendant Commander Danath Trollbane in forming the Sons of Lothar, also known as the Alliance Expedition. <br><br> The allied forces, calling themselves the Sons of Lothar in honor of the fallen war hero, pursue the Horde through the Dark Portal into the ruins of Draenor with the intent to end the Horde once and for all. Despite their victories against the orcish Horde there, their Expedition faces disaster as the world is torn asunder by the opening of countless portals, damning countless soldiers to the abyss, and resulting in the presumed loss of the Expedition, and both General Turalyon and Ranger-Captain Alleria Windrunner. <br><br>  years the Expedition is presumed lost beyond the now-decimated Dark Portal. \n      ",
      "order": 9
    },
    {
      "id": "greatwars",
      "title": "Lore: First & Second Wars",
      "subtitle": "Game: Warcraft I & II",
      "date": "c. Years 0–7",
      "summary_html": "\n Groomed and corrupted by the Burning Legion, the orcs of Draeneor force open the Dark Portal and storm into Azeroth; the human nation of Stormwind falls, and the human descendants of the ancient Arathi king summon the pact made between humanity and the Quel'dorei during the Troll Wars. <br><br> A Grand Alliance is formed, and humanity and elvenkind stand side by side against the savagery of the Horde; the Elrendar Fellowship takes an active role in fighting against the Horde, and many of its users begin to study the magic used by the orcish warlocks, including voidmancy, necromancy, and felmancy. Research tied to these dark schools is carefully stored and secured far from the reach of the common magi. <br><br> During the Second War, the barbaric fel Horde enslaves the red Dragonflight and, with its Amani allies, burns much of Quel’Thalas. Silvermoon endures a brutal siege before Alliance counteroffensives drives back the invaders, and ultimately the Horde is broken at Blackrock Mountain. The Dark Portal is destroyed, and the orcs interned within prison camps; despite the hard won victory, the long scars in Thalassian forests and memory remain.\n          ",
      "order": 8
    },
    {
      "id": "windrunneranomaly",
      "title": "Event: Anomaly at Windrunner Village",
      "subtitle": "Guild History",
      "date": "c. Year -2,300",
      "summary_html": "\n Founding member Tayan'adara Autumbloom responds to aid from Windrunner Village in southern Quel'Thalas where an arcane anomaly is reported to be threatening the township. Upon arriving, she discovers the anomaly to in fact be an unstable void entity, and battles against it before banishing the entity's remnants. The anomaly's explosive demise, however, a rift into the Void itself, threatening the town. Tayan’adara Autumbloom journeys through the rift and seals it from the otherside, and is presumed dead by the Fellowship. An investigation into the disruption and anomaly is linked to the reckless experimentation and spellcasting of a lone magi who sought to draw energy from the void. The magi responsible is questioned and imprisoned by the local authorities, though Tayan'adara is not seen or heard from for thousands of years.\n",
      "order": 7
    },
    {
      "id": "foundingorder",
      "title": "Lore: Formation of the Elrendar Fellowship",
      "subtitle": "Guild History",
      "date": "c. Year -2,680",
      "summary_html": "\nUnderstanding that knowledge of the Highborne’s failings in the past could be forgotten due to a concerted focus on revising elven history to minimize perceived faults, a sect of elven magi within Quel’Thalas establish the <em>Elrendar Fellowship</em>, an organization designed to rotate magi to various townships and settlements throughout Quel’Thalas to share and spread knowledge, and teach restraint, in a discrete manner.<br><br>In addition to teaching the arcane in more measured and responsible ways, the cohort of magi also work to preserve defenses across Quel’Thalas, while yet another secret sub-sect begins to study dangerous magics with the intent of negating its influence should it ever be used against the High Home. Early members include Tayan’adara Autumnbloom.<br><br>The early members establish an oath to bind one another to the Fellowship and to each other, and chief of all, to their shared purpose.<br><br><em>With this vow I bind my name to the carving stone, and my hand to the eternal vigil,<br>And that I be keeper, not tyrant; blade in shadow, not hand of terror.<br><br>Where the people stand unguarded, I shall stand in their stead.<br>When ignorance seeks to enthrall, my knowledge shall liberate.<br><br>I shall temper power with discipline, desire with restraint, and judgment with mercy.<br>I will seek forbidden truths and buried knowledge—not for conquest,<br>but to raise the world from ignorance and preserve the soul of the High Home.<br><br>Should I turn my art to cruelty, my wisdom to vanity, or my silence to cowardice,<br>let the light that crowns the wise abandon me,<br>let my carved name in the stone be ground out,<br>and let my name be unmade among those who endure.</em><br><br><strong>The inductees then respond:</strong><br><em>By the glory of the children of the sun I do swear and abide.</em>\n",
      "order": 6
    },    
    {
      "id": "trollwars",
      "title": "Lore: The Troll Wars",
      "subtitle": "Ancient History",
      "date": "c. Year -2,800",
      "summary_html": "\n With the Amani trolls now pinned between the thriving nation of Quel'Thalas and the rapidly expanding human-led Arathi Empire in the south, the trolls desperately reach out to the Zandalari Empire, which agrees to bolster their ranks. The trolls form a massive army and lay siege to Quel'Thalas, exacting a bloody and costly toll which only continues to mount. During the war, the Quel'dorei form numerous organizations to better counter the Amani, including the Farstriders—the rangers of the woodland realm. <br><br> King Anasterian Sunstrider—a descendant of Dath'remar Sunstrider himself—dispatches couriers to the humans of the Arathi Empire, warning that the trolls would turn their attention towards humanity should the elven kingdom fall, and manages to secure the Empire's aid in exchange for teaching one hundred humans the ways of the arcane. Working together, the First Alliance decimates the Amani and Zandalari armies, and the elves subsequently pursue the Amani to the brink of extinction. Never able to fully recover from their devastating loss, the Amani commit themselves to an existence of raiding the elven lands in small warbands, but never more than that. <br><br> The First Alliance retains its strength for years, but inevitable the Kingdom of Quel'Thalas opts for seclusion and withdraws itself from the business of the southern kingdoms. \n      ",
      "order": 5
    },
    {
      "id": "heartofthebough",
      "title": "Lore: Heart of the Bough",
      "subtitle": "Ancient History",
      "date": "c. Year -6,800",
      "summary_html": "\n In the years following the creation of the Sunwell in Quel'Thalas, radiant energy from the powerful font leads to the accelerated growth of the wilds throughout the northern penninsula. One area in particular, in the far south, expands rapidly, and becomes home to a tree of tremendous height-Thas'alah, the mother tree of Quel'Thalas. Many treants and other guardians of nature migrant to this grove, and the area surrounding it becomes a haven where life flourishes. In one of the passages leading into the grove of Thas'alah, one treant in particular continues to grow and evolve, eventually becoming more akin to one of the Ancients commonly seen amongst the Kaldorei. This Ancient of nature becomes one of the foremost guardians of the mother tree, raising treants and tending to the grove to ensure its integrity and health. At the core of this Ancient lies the Heart of the Bough, an item which in later years would become a powerful, albeit corrupted artifact. The Ancient, like many in Quel'Thalas, is slain during the Scourge's invasion of Quel'Thalas in Year 20. \n      ",
      "order": 4
    },
    {
      "id": "foundingnation",
      "title": "Lore: Exile, & The Founding of Quel'Thalas",
      "subtitle": "Ancient History",
      "date": "c. Year -6,800",
      "summary_html": "\n In the wake of the surviving Highborne's exile from Kalimdor, the elves sail east across the sea and struggle terribly during their exodus. Those who survive the journey arrive in the Old God tainted lands now known as Tirisfal—where the ancient Titan Keeper Tyr was slain in battle against one of the Old Gods' minons. Falling to madness and withering away without the arcane power of the Well of Eternity that once sustained them, the elves waste away quickly, and further fall victim to attacks by the Amani trolls. <br><br> The elves embrace their ancient identity of tied to the arcane as a way to hold back the trolls, but it isn't until they come across a stretch of land—land sacred to the Amani trolls—upon which the legendary mage Dath'remar Sunstrider forms the Sunwell with water taken from the ancient Well of Eternity. With a vast font of magic to draw from, the elves proclaim themselves <em>Quel'dorei</em>, High Elves, and begin to secure their holdings. <br><br> They fight back fiercely against the trolls, wielding powerful magic now without restraint. In a rapid but bloody war, the elves drive back the Amani and cement their hold over the northern peninsula, which they claim as their Kingdom—<em>Quel'Thalas</em>, the High Home.\n      ",
      "order": 3
    },
    {
      "id": "wota",
      "title": "Lore: War of the Ancients",
      "subtitle": "Ancient History",
      "date": "c. Year -10,000",
      "summary_html": "\n Queen Azshara’s Highborne open Azeroth to the Burning Legion through the Well of Eternity, a pact made in exchange for untold power. The Kaldorei Resistance—druids, sentinels, Moon Guard magi, allies, and the Dragonflights—shatter the portal after a costly war; the Well collapses, sundering Kalimdor into continents. The elven city of Suramar seals itself beneath the power of the Nightwell. Queen Azshara's nobles are drowned alongside the common folk, with many being transformed into the insideous <em>Naga</em> through yet another pact made by the Queen, this time with the imprisoned Old God, N'zoth. Other surviving Highborne are later exiled for continuing to use magic; they sail east and proclaim themselves <em>Quel’dorei</em>. The world survives, but its peoples and cities are forever divided.\n              ",
      "order": 2
    },
    {
      "id": "origins",
      "title": "Lore: Origins & Black Empire",
      "subtitle": "Ancient History",
      "date": "c. Years -25,000 to -15,000",
      "summary_html": "\n Old Gods burrow into Azeroth, enthroning the Black Empire just before the Titans arrive to order the world. The Titan-Forged defeat and imprison the Old Gods; the Well of Eternity is born of the death of one Old God, and its power accelerates the growth and evolution of life. Proto-dragons become Aspects; early trolls establish empires; dark trolls dwelling near the Well slowly transform into the <em>Kaldorei</em>, Children of the Stars. Seeds of later schisms—arcane vs. wilds, priesthood vs. nobles—take root around Elun’dris—the capital later renamed Zin-Azshari after Queen Azshara.<br><br>Her most favored nobles embrace the arcane and largely remove themselves from the lives of the common folk. Their pursuit of greater power leads them to create their own caste in society, the <em>Highborne</em>.\n",
      "order": 1
    }
  ]
}
